OpenFOAM-case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-03;

vertices
(
    (-5.9396955 -7.9196 0)
    (29.698 -7.9196 0)
    (29.698 3.959797 0)
    (-5.9396955 3.959797 0)
    (-5.9396955 -7.9196 1.4)
    (29.698 -7.9196 1.4)
    (29.698 3.959797 1.4)
    (-5.9396955 3.959797 1.4)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 75 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    PatchFront
    {
        type patch;
	faces
        (
            (3 7 6 2)
        );
    }

    PatchBack
    {
        type patch;
	faces
        (
            (1 5 4 0)
        );
    }
 
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    upperWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
