OpenFOAM-case/system/pressureDifferencePatch.cfg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

#include "pressureDifference.cfg"

region1
{
    regionType  patch;
    name        $patch1;
}
region2
{
    regionType  patch;
    name        $patch2;
}

// ************************************************************************* //
